SushiBits/platform-stm32f3/include/stm32f318xx_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f3xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt)
IRQN_HANDLER(-13, HardFault)
IRQN_HANDLER(-12, MemoryManagement)
IRQN_HANDLER(-11, BusFault)
IRQN_HANDLER(-10, UsageFault)
SKIP_HANDLER(-9)
SKIP_HANDLER(-8)
SKIP_HANDLER(-7)
SKIP_HANDLER(-6)
IRQN_HANDLER(-5, SVCall)
IRQN_HANDLER(-4, DebugMonitor)
SKIP_HANDLER(-3)
IRQN_HANDLER(-2, PendSV)
IRQN_HANDLER(-1, SysTick)
IRQN_HANDLER(0, WWDG)
SKIP_HANDLER(1)
IRQN_HANDLER(2, TAMP_STAMP)
IRQN_HANDLER(3, RTC_WKUP)
IRQN_HANDLER(4, FLASH)
IRQN_HANDLER(5, RCC)
IRQN_HANDLER(6, EXTI0)
IRQN_HANDLER(7, EXTI1)
IRQN_HANDLER(8, EXTI2_TSC)
IRQN_HANDLER(9, EXTI3)
IRQN_HANDLER(10, EXTI4)
IRQN_HANDLER(11, DMA1_Channel1)
IRQN_HANDLER(12, DMA1_Channel2)
IRQN_HANDLER(13, DMA1_Channel3)
IRQN_HANDLER(14, DMA1_Channel4)
IRQN_HANDLER(15, DMA1_Channel5)
IRQN_HANDLER(16, DMA1_Channel6)
IRQN_HANDLER(17, DMA1_Channel7)
IRQN_HANDLER(18, ADC1)
SKIP_HANDLER(19)
SKIP_HANDLER(20)
SKIP_HANDLER(21)
SKIP_HANDLER(22)
IRQN_HANDLER(23, EXTI9_5)
IRQN_HANDLER(24, TIM1_BRK_TIM15)
IRQN_HANDLER(25, TIM1_UP_TIM16)
IRQN_HANDLER(26, TIM1_TRG_COM_TIM17)
IRQN_HANDLER(27, TIM1_CC)
IRQN_HANDLER(28, TIM2)
SKIP_HANDLER(29)
SKIP_HANDLER(30)
IRQN_HANDLER(31, I2C1_EV)
IRQN_HANDLER(32, I2C1_ER)
IRQN_HANDLER(33, I2C2_EV)
IRQN_HANDLER(34, I2C2_ER)
SKIP_HANDLER(35)
IRQN_HANDLER(36, SPI2)
IRQN_HANDLER(37, USART1)
IRQN_HANDLER(38, USART2)
IRQN_HANDLER(39, USART3)
IRQN_HANDLER(40, EXTI15_10)
IRQN_HANDLER(41, RTC_Alarm)
SKIP_HANDLER(42)
SKIP_HANDLER(43)
SKIP_HANDLER(44)
SKIP_HANDLER(45)
SKIP_HANDLER(46)
SKIP_HANDLER(47)
SKIP_HANDLER(48)
SKIP_HANDLER(49)
SKIP_HANDLER(50)
IRQN_HANDLER(51, SPI3)
SKIP_HANDLER(52)
SKIP_HANDLER(53)
IRQN_HANDLER(54, TIM6_DAC)
SKIP_HANDLER(55)
SKIP_HANDLER(56)
SKIP_HANDLER(57)
SKIP_HANDLER(58)
SKIP_HANDLER(59)
SKIP_HANDLER(60)
SKIP_HANDLER(61)
SKIP_HANDLER(62)
SKIP_HANDLER(63)
IRQN_HANDLER(64, COMP2)
IRQN_HANDLER(65, COMP4_6)
SKIP_HANDLER(66)
SKIP_HANDLER(67)
SKIP_HANDLER(68)
SKIP_HANDLER(69)
SKIP_HANDLER(70)
SKIP_HANDLER(71)
IRQN_HANDLER(72, I2C3_EV)
IRQN_HANDLER(73, I2C3_ER)
SKIP_HANDLER(74)
SKIP_HANDLER(75)
SKIP_HANDLER(76)
SKIP_HANDLER(77)
SKIP_HANDLER(78)
SKIP_HANDLER(79)
SKIP_HANDLER(80)
IRQN_HANDLER(81, FPU)

#endif

